PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_smif_v5.h
/**
  * \brief Serial Memory Interface (SMIF_CORE)
  */
typedef struct
{
    __IOM uint32_t CTL;                           /*!< 0x00000000 Control */
    __IM uint32_t STATUS;                        /*!< 0x00000004 Status */
    __IOM uint32_t CTL2;                          /*!< 0x00000008 Control 2 */
    __IM uint32_t RESERVED;
    __IM uint32_t DLP_DELAY_TAP_SEL0;            /*!< 0x00000010 DLP Delay Tap Select Register 0 */
    __IM uint32_t DLP_DELAY_TAP_SEL1;            /*!< 0x00000014 DLP Delay Tap Select Register 1 */
    __IOM uint32_t DLP_CTL;                       /*!< 0x00000018 DLP Control Register */
    __IM uint32_t RESERVED1;
    __IM uint32_t DLP_STATUS0;                   /*!< 0x00000020 DLP Status Register 0 */
    __IM uint32_t DLP_STATUS1;                   /*!< 0x00000024 DLP Status Register 1 */
    __IM uint32_t RESERVED2[7];
    __IM uint32_t TX_CMD_FIFO_STATUS;            /*!< 0x00000044 Transmitter command FIFO status */
    __IM uint32_t TX_CMD_MMIO_FIFO_STATUS;       /*!< 0x00000048 Transmitter command MMIO FIFO status */
    __IM uint32_t RESERVED3;
    __OM uint32_t TX_CMD_MMIO_FIFO_WR;           /*!< 0x00000050 Transmitter command MMIO FIFO write */
    __IM uint32_t RESERVED4[11];
    __IOM uint32_t TX_DATA_MMIO_FIFO_CTL;         /*!< 0x00000080 Transmitter data MMIO FIFO control */
    __IM uint32_t TX_DATA_FIFO_STATUS;           /*!< 0x00000084 Transmitter data FIFO status */
    __IM uint32_t TX_DATA_MMIO_FIFO_STATUS;      /*!< 0x00000088 Transmitter data MMIO FIFO status */
    __IM uint32_t RESERVED5;
    __OM uint32_t TX_DATA_MMIO_FIFO_WR1;         /*!< 0x00000090 Transmitter data MMIO FIFO write */
    __OM uint32_t TX_DATA_MMIO_FIFO_WR2;         /*!< 0x00000094 Transmitter data MMIO FIFO write */
    __OM uint32_t TX_DATA_MMIO_FIFO_WR4;         /*!< 0x00000098 Transmitter data MMIO FIFO write */
    __OM uint32_t TX_DATA_MMIO_FIFO_WR1ODD;      /*!< 0x0000009C Transmitter data MMIO FIFO write */
    __IM uint32_t RESERVED6[8];
    __IOM uint32_t RX_DATA_MMIO_FIFO_CTL;         /*!< 0x000000C0 Receiver data MMIO FIFO control */
    __IM uint32_t RX_DATA_MMIO_FIFO_STATUS;      /*!< 0x000000C4 Receiver data MMIO FIFO status */
    __IM uint32_t RX_DATA_FIFO_STATUS;           /*!< 0x000000C8 Receiver data FIFO status */
    __IM uint32_t RESERVED7;
    __IM uint32_t RX_DATA_MMIO_FIFO_RD1;         /*!< 0x000000D0 Receiver data MMIO FIFO read */
    __IM uint32_t RX_DATA_MMIO_FIFO_RD2;         /*!< 0x000000D4 Receiver data MMIO FIFO read */
    __IM uint32_t RX_DATA_MMIO_FIFO_RD4;         /*!< 0x000000D8 Receiver data MMIO FIFO read */
    __IM uint32_t RESERVED8;
    __IM uint32_t RX_DATA_MMIO_FIFO_RD1_SILENT;  /*!< 0x000000E0 Receiver data MMIO FIFO silent read */
    __IM uint32_t RESERVED9[7];
    __IOM uint32_t SLOW_CA_CTL;                   /*!< 0x00000100 Slow cache control */
    __IM uint32_t RESERVED10;
    __IOM uint32_t SLOW_CA_CMD;                   /*!< 0x00000108 Slow cache command */
    __IM uint32_t RESERVED11[29];
    __IOM uint32_t FAST_CA_CTL;                   /*!< 0x00000180 Fast cache control */
    __IM uint32_t RESERVED12;
    __IOM uint32_t FAST_CA_CMD;                   /*!< 0x00000188 Fast cache command */
    __IM uint32_t RESERVED13[29];
    SMIF_CORE_SMIF_CRYPTO_Type SMIF_CRYPTO_BLOCK[4]; /*!< 0x00000200 Cryptography registers (one set for each key) */
    __IM uint32_t RESERVED14[128];
    __IOM uint32_t CRC_CMD;                       /*!< 0x00000600 CRC Command */
    __IM uint32_t RESERVED15[7];
    __IOM uint32_t CRC_INPUT0;                    /*!< 0x00000620 CRC input 0 */
    __IOM uint32_t CRC_INPUT1;                    /*!< 0x00000624 CRC input 1 */
    __IM uint32_t RESERVED16[6];
    __IM uint32_t CRC_OUTPUT;                    /*!< 0x00000640 CRC output */
    __IM uint32_t RESERVED17[95];
    __IOM uint32_t INTR;                          /*!< 0x000007C0 Interrupt register */
    __IOM uint32_t INTR_SET;                      /*!< 0x000007C4 Interrupt set register */
    __IOM uint32_t INTR_MASK;                     /*!< 0x000007C8 Interrupt mask register */
    __IM uint32_t INTR_MASKED;                   /*!< 0x000007CC Interrupt masked register */
    __IM uint32_t RESERVED18[2];
    __IOM uint32_t DLL_IDAC;                      /*!< 0x000007D8 DLL IDAC ( when DLL runs in open loop, selects the delay of the
                                                                delay line) */
    __IOM uint32_t DLL_IVR;                       /*!< 0x000007DC DLL IVR (Contol Output Voltage of internal Voltage Regulator ) */
    __IM uint32_t RESERVED19[8];
    SMIF_CORE_DEVICE_Type DEVICE[4];        /*!< 0x00000800 Device (only used for XIP acceses) */
    __IM uint32_t RESERVED20[384];
    SMIF_CORE_SLOW_AHB_Type SLOW_AHB;       /*!< 0x00001000 Serial Memory Interface */
    SMIF_CORE_FAST_AHB_Type FAST_AHB;       /*!< 0x00002000 Serial Memory Interface */
    SMIF_CORE_AXI_Type AXI;                 /*!< 0x00003000 Serial Memory Interface */
    SMIF_CORE_SMIF_HSIOM_Type SMIF_HSIOM;   /*!< 0x00004000 IO Matrix (IOM) */
    __IM uint32_t RESERVED21[8192];
    SMIF_CORE_SMIF_GPIO_Type SMIF_GPIO;     /*!< 0x00010000 IO port control/configuration */
} SMIF_CORE_Type;                               /*!< Size = 131072 (0x20000) */

/**
  * \brief SMIF subsystem (bridge + 2 core SMIFs, OR no bridge and 1 core SMIF) (SMIF_STRUCT)
  */
typedef struct
{
    SMIF_SMIF_BRIDGE_Type SMIF_BRIDGE;      /*!< 0x00000000 AXI/AHB interleaving and FOTA bridge */
    __IM uint32_t RESERVED[16384];
    SMIF_CORE_Type CORE[2];                 /*!< 0x00020000 Serial Memory Interface */
} SMIF_STRUCT_Type;                             /*!< Size = 393216 (0x60000) */


/* SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION.CTL */
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_USE_SMIF_Pos 0UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_USE_SMIF_Msk 0x3UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_INTLV_STEP_SIZE_Pos 16UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_INTLV_STEP_SIZE_Msk 0x70000UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_SMIF_SPACE_Pos 31UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_CTL_SMIF_SPACE_Msk 0x80000000UL
/* SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION.ADDR */
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_ADDR_ADDR_Pos 20UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_ADDR_ADDR_Msk 0x1FF00000UL
/* SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION.MASK */
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_MASK_MASK_Pos 20UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_MASK_MASK_Msk 0x1FF00000UL
/* SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION.SMIF0_REMAP */
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_SMIF0_REMAP_SMIF0_REMAP_Pos 20UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_SMIF0_REMAP_SMIF0_REMAP_Msk 0x1FF00000UL
/* SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION.SMIF1_REMAP */
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_SMIF1_REMAP_SMIF1_REMAP_Pos 20UL
#define SMIF_SMIF_BRIDGE_SMIF_REMAP_REGION_SMIF1_REMAP_SMIF1_REMAP_Msk 0x1FF00000UL


/* SMIF_SMIF_BRIDGE.CTL */
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AHB_SMIF0_Pos 0UL
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AHB_SMIF0_Msk 0x1UL
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AHB_SMIF1_Pos 1UL
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AHB_SMIF1_Msk 0x2UL
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AXI_SMIF0_Pos 8UL
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AXI_SMIF0_Msk 0x100UL
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AXI_SMIF1_Pos 9UL
#define SMIF_SMIF_BRIDGE_CTL_ARB_PRI_AXI_SMIF1_Msk 0x200UL
#define SMIF_SMIF_BRIDGE_CTL_ENABLED_Pos        31UL
#define SMIF_SMIF_BRIDGE_CTL_ENABLED_Msk        0x80000000UL


/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_CMD */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_CMD_START_Msk 0x1UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_ADDR */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_ADDR_ADDR_Pos 8UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_ADDR_ADDR_Msk 0xFFFFFF00UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_MASK */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_MASK_MASK_Pos 8UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_MASK_MASK_Msk 0xFFFFFF00UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_SUBREGION */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_SUBREGION_SUBREGION_DISABLE_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_SUBREGION_SUBREGION_DISABLE_Msk 0xFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT0 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_LSB_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_LSB_Msk 0xFUL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_MSB_Pos 4UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT0_INPUT_MSB_Msk 0xFFFFFFF0UL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT1 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT1_INPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT1_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT2 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT2_INPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT2_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_INPUT3 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT3_INPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_INPUT3_INPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY0 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY0_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY0_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY1 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY1_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY1_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY2 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY2_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY2_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_KEY3 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY3_KEY_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_KEY3_KEY_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT0 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT0_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT0_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT1 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT1_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT1_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT2 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT2_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT2_OUTPUT_Msk 0xFFFFFFFFUL
/* SMIF_CORE_SMIF_CRYPTO.CRYPTO_OUTPUT3 */
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT3_OUTPUT_Pos 0UL
#define SMIF_CORE_SMIF_CRYPTO_CRYPTO_OUTPUT3_OUTPUT_Msk 0xFFFFFFFFUL


/* SMIF_CORE_DEVICE.CTL */
#define SMIF_CORE_DEVICE_CTL_WR_EN_Pos          0UL
#define SMIF_CORE_DEVICE_CTL_WR_EN_Msk          0x1UL
#define SMIF_CORE_DEVICE_CTL_CRYPTO_EN_Pos      4UL
#define SMIF_CORE_DEVICE_CTL_CRYPTO_EN_Msk      0x10UL
#define SMIF_CORE_DEVICE_CTL_DATA_SEL_Pos       8UL
#define SMIF_CORE_DEVICE_CTL_DATA_SEL_Msk       0x300UL
#define SMIF_CORE_DEVICE_CTL_MERGE_TIMEOUT_Pos  12UL
#define SMIF_CORE_DEVICE_CTL_MERGE_TIMEOUT_Msk  0x7000UL
#define SMIF_CORE_DEVICE_CTL_MERGE_EN_Pos       15UL
#define SMIF_CORE_DEVICE_CTL_MERGE_EN_Msk       0x8000UL
#define SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_Pos  16UL
#define SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_Msk  0x3FFF0000UL
#define SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_EN_Pos 30UL
#define SMIF_CORE_DEVICE_CTL_TOTAL_TIMEOUT_EN_Msk 0x40000000UL
#define SMIF_CORE_DEVICE_CTL_ENABLED_Pos        31UL
#define SMIF_CORE_DEVICE_CTL_ENABLED_Msk        0x80000000UL
/* SMIF_CORE_DEVICE.ADDR */
#define SMIF_CORE_DEVICE_ADDR_ADDR_Pos          8UL
#define SMIF_CORE_DEVICE_ADDR_ADDR_Msk          0xFFFFFF00UL
/* SMIF_CORE_DEVICE.MASK */
#define SMIF_CORE_DEVICE_MASK_MASK_Pos          8UL
#define SMIF_CORE_DEVICE_MASK_MASK_Msk          0xFFFFFF00UL
/* SMIF_CORE_DEVICE.ADDR_CTL */
#define SMIF_CORE_DEVICE_ADDR_CTL_SIZE3_Pos     0UL
#define SMIF_CORE_DEVICE_ADDR_CTL_SIZE3_Msk     0x7UL
#define SMIF_CORE_DEVICE_ADDR_CTL_DIV2_Pos      8UL
#define SMIF_CORE_DEVICE_ADDR_CTL_DIV2_Msk      0x100UL
/* SMIF_CORE_DEVICE.RX_CAPTURE_CONFIG */
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_NEG_SDL_TAP_SEL_Pos 0UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_NEG_SDL_TAP_SEL_Msk 0xFUL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_POS_SDL_TAP_SEL_Pos 4UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_POS_SDL_TAP_SEL_Msk 0xF0UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_FW_CALIBRATION_MODE_Pos 8UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_FW_CALIBRATION_MODE_Msk 0x100UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_SDR_PIPELINE_NEG_DAT_Pos 16UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_SDR_PIPELINE_NEG_DAT_Msk 0x10000UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_SDR_SWAP_BYTES_Pos 17UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_SDR_SWAP_BYTES_Msk 0x20000UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_PIPELINE_POS_DAT_Pos 24UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_PIPELINE_POS_DAT_Msk 0x1000000UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_SWAP_BYTES_Pos 25UL
#define SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_SWAP_BYTES_Msk 0x2000000UL
/* SMIF_CORE_DEVICE.RD_STATUS */
#define SMIF_CORE_DEVICE_RD_STATUS_FS_STATUS_Pos 0UL
#define SMIF_CORE_DEVICE_RD_STATUS_FS_STATUS_Msk 0xFFUL
/* SMIF_CORE_DEVICE.RD_CMD_CTL */
#define SMIF_CORE_DEVICE_RD_CMD_CTL_CODE_Pos    0UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_CODE_Msk    0xFFUL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_CODEH_Pos   8UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_CODEH_Msk   0xFF00UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_WIDTH_Pos   16UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_WIDTH_Msk   0x30000UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_DDR_MODE_Msk 0x40000UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_PRESENT2_Pos 30UL
#define SMIF_CORE_DEVICE_RD_CMD_CTL_PRESENT2_Msk 0xC0000000UL
/* SMIF_CORE_DEVICE.RD_ADDR_CTL */
#define SMIF_CORE_DEVICE_RD_ADDR_CTL_WIDTH_Pos  16UL
#define SMIF_CORE_DEVICE_RD_ADDR_CTL_WIDTH_Msk  0x30000UL
#define SMIF_CORE_DEVICE_RD_ADDR_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_RD_ADDR_CTL_DDR_MODE_Msk 0x40000UL
/* SMIF_CORE_DEVICE.RD_MODE_CTL */
#define SMIF_CORE_DEVICE_RD_MODE_CTL_CODE_Pos   0UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_CODE_Msk   0xFFUL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_CODEH_Pos  8UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_CODEH_Msk  0xFF00UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_WIDTH_Pos  16UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_WIDTH_Msk  0x30000UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_DDR_MODE_Msk 0x40000UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_PRESENT2_Pos 30UL
#define SMIF_CORE_DEVICE_RD_MODE_CTL_PRESENT2_Msk 0xC0000000UL
/* SMIF_CORE_DEVICE.RD_DUMMY_CTL */
#define SMIF_CORE_DEVICE_RD_DUMMY_CTL_SIZE5_Pos 0UL
#define SMIF_CORE_DEVICE_RD_DUMMY_CTL_SIZE5_Msk 0x1FUL
#define SMIF_CORE_DEVICE_RD_DUMMY_CTL_PRESENT2_Pos 30UL
#define SMIF_CORE_DEVICE_RD_DUMMY_CTL_PRESENT2_Msk 0xC0000000UL
/* SMIF_CORE_DEVICE.RD_DATA_CTL */
#define SMIF_CORE_DEVICE_RD_DATA_CTL_WIDTH_Pos  16UL
#define SMIF_CORE_DEVICE_RD_DATA_CTL_WIDTH_Msk  0x30000UL
#define SMIF_CORE_DEVICE_RD_DATA_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_RD_DATA_CTL_DDR_MODE_Msk 0x40000UL
/* SMIF_CORE_DEVICE.RD_CRC_CTL */
#define SMIF_CORE_DEVICE_RD_CRC_CTL_STATUS_CHECK_MASK_Pos 0UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_STATUS_CHECK_MASK_Msk 0xFFUL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_STATUS_ERROR_POL_Pos 8UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_STATUS_ERROR_POL_Msk 0xFF00UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_DATA_CRC_INPUT_SIZE_Pos 16UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_DATA_CRC_INPUT_SIZE_Msk 0xFF0000UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_WIDTH_Pos 24UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_WIDTH_Msk 0x3000000UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Pos 26UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Msk 0x4000000UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_INPUT_Pos 27UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_INPUT_Msk 0x8000000UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_DATA_CRC_CHECK_Pos 28UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_DATA_CRC_CHECK_Msk 0x10000000UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_PRESENT_Pos 30UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_CMD_ADDR_CRC_PRESENT_Msk 0x40000000UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_DATA_CRC_PRESENT_Pos 31UL
#define SMIF_CORE_DEVICE_RD_CRC_CTL_DATA_CRC_PRESENT_Msk 0x80000000UL
/* SMIF_CORE_DEVICE.RD_BOUND_CTL */
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SIZE5_Pos 0UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SIZE5_Msk 0x1FUL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Pos 16UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE_Msk 0x30000UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Pos 20UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR_Msk 0x300000UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Pos 28UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN_Msk 0x10000000UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_PRESENT_Pos 31UL
#define SMIF_CORE_DEVICE_RD_BOUND_CTL_PRESENT_Msk 0x80000000UL
/* SMIF_CORE_DEVICE.WR_CMD_CTL */
#define SMIF_CORE_DEVICE_WR_CMD_CTL_CODE_Pos    0UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_CODE_Msk    0xFFUL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_CODEH_Pos   8UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_CODEH_Msk   0xFF00UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_WIDTH_Pos   16UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_WIDTH_Msk   0x30000UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_DDR_MODE_Msk 0x40000UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_PRESENT2_Pos 30UL
#define SMIF_CORE_DEVICE_WR_CMD_CTL_PRESENT2_Msk 0xC0000000UL
/* SMIF_CORE_DEVICE.WR_ADDR_CTL */
#define SMIF_CORE_DEVICE_WR_ADDR_CTL_WIDTH_Pos  16UL
#define SMIF_CORE_DEVICE_WR_ADDR_CTL_WIDTH_Msk  0x30000UL
#define SMIF_CORE_DEVICE_WR_ADDR_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_WR_ADDR_CTL_DDR_MODE_Msk 0x40000UL
/* SMIF_CORE_DEVICE.WR_MODE_CTL */
#define SMIF_CORE_DEVICE_WR_MODE_CTL_CODE_Pos   0UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_CODE_Msk   0xFFUL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_CODEH_Pos  8UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_CODEH_Msk  0xFF00UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_WIDTH_Pos  16UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_WIDTH_Msk  0x30000UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_DDR_MODE_Msk 0x40000UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_PRESENT2_Pos 30UL
#define SMIF_CORE_DEVICE_WR_MODE_CTL_PRESENT2_Msk 0xC0000000UL
/* SMIF_CORE_DEVICE.WR_DUMMY_CTL */
#define SMIF_CORE_DEVICE_WR_DUMMY_CTL_SIZE5_Pos 0UL
#define SMIF_CORE_DEVICE_WR_DUMMY_CTL_SIZE5_Msk 0x1FUL
#define SMIF_CORE_DEVICE_WR_DUMMY_CTL_RWDS_EN_Pos 17UL
#define SMIF_CORE_DEVICE_WR_DUMMY_CTL_RWDS_EN_Msk 0x20000UL
#define SMIF_CORE_DEVICE_WR_DUMMY_CTL_PRESENT2_Pos 30UL
#define SMIF_CORE_DEVICE_WR_DUMMY_CTL_PRESENT2_Msk 0xC0000000UL
/* SMIF_CORE_DEVICE.WR_DATA_CTL */
#define SMIF_CORE_DEVICE_WR_DATA_CTL_WIDTH_Pos  16UL
#define SMIF_CORE_DEVICE_WR_DATA_CTL_WIDTH_Msk  0x30000UL
#define SMIF_CORE_DEVICE_WR_DATA_CTL_DDR_MODE_Pos 18UL
#define SMIF_CORE_DEVICE_WR_DATA_CTL_DDR_MODE_Msk 0x40000UL
/* SMIF_CORE_DEVICE.WR_CRC_CTL */
#define SMIF_CORE_DEVICE_WR_CRC_CTL_DATA_CRC_INPUT_SIZE_Pos 16UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_DATA_CRC_INPUT_SIZE_Msk 0xFF0000UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_WIDTH_Pos 24UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_WIDTH_Msk 0x3000000UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Pos 26UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_DDR_MODE_Msk 0x4000000UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_INPUT_Pos 27UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_INPUT_Msk 0x8000000UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_PRESENT_Pos 30UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_CMD_ADDR_CRC_PRESENT_Msk 0x40000000UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_DATA_CRC_PRESENT_Pos 31UL
#define SMIF_CORE_DEVICE_WR_CRC_CTL_DATA_CRC_PRESENT_Msk 0x80000000UL
/* SMIF_CORE_DEVICE.HB_FW_DEL_TAP_SEL_0 */
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT0_TAP_SEL_POS_Pos 0UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT0_TAP_SEL_POS_Msk 0xFUL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT0_TAP_SEL_NEG_Pos 4UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT0_TAP_SEL_NEG_Msk 0xF0UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT1_TAP_SEL_POS_Pos 8UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT1_TAP_SEL_POS_Msk 0xF00UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT1_TAP_SEL_NEG_Pos 12UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT1_TAP_SEL_NEG_Msk 0xF000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT2_TAP_SEL_POS_Pos 16UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT2_TAP_SEL_POS_Msk 0xF0000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT2_TAP_SEL_NEG_Pos 20UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT2_TAP_SEL_NEG_Msk 0xF00000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT3_TAP_SEL_POS_Pos 24UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT3_TAP_SEL_POS_Msk 0xF000000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT3_TAP_SEL_NEG_Pos 28UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT3_TAP_SEL_NEG_Msk 0xF0000000UL
/* SMIF_CORE_DEVICE.HB_FW_DEL_TAP_SEL_1 */
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT4_TAP_SEL_POS_Pos 0UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT4_TAP_SEL_POS_Msk 0xFUL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT4_TAP_SEL_NEG_Pos 4UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT4_TAP_SEL_NEG_Msk 0xF0UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT5_TAP_SEL_POS_Pos 8UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT5_TAP_SEL_POS_Msk 0xF00UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT5_TAP_SEL_NEG_Pos 12UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT5_TAP_SEL_NEG_Msk 0xF000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT6_TAP_SEL_POS_Pos 16UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT6_TAP_SEL_POS_Msk 0xF0000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT6_TAP_SEL_NEG_Pos 20UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT6_TAP_SEL_NEG_Msk 0xF00000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT7_TAP_SEL_POS_Pos 24UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT7_TAP_SEL_POS_Msk 0xF000000UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT7_TAP_SEL_NEG_Pos 28UL
#define SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT7_TAP_SEL_NEG_Msk 0xF0000000UL


